include/fedex/sample/Ground/Domestic/ProcessShipmentRequest.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://fedex.com/ws/ship/v8"><SOAP-ENV:Body><ProcessShipmentRequest><WebAuthenticationDetail><UserCredential><Key></Key><Password></Password></UserCredential></WebAuthenticationDetail><ClientDetail><AccountNumber></AccountNumber><MeterNumber></MeterNumber><ClientProductId>WBUS</ClientProductId><ClientProductVersion>0200</ClientProductVersion></ClientDetail><TransactionDetail><CustomerTransactionId>TC02_USUS_E01011_DOM_Exp_POS</CustomerTransactionId></TransactionDetail><Version><ServiceId>ship</ServiceId><Major>8</Major><Intermediate>0</Intermediate><Minor>0</Minor></Version><RequestedShipment><ShipTimestamp>2010-03-16T09:30:47-05:00</ShipTimestamp><DropoffType>REGULAR_PICKUP</DropoffType><ServiceType>PRIORITY_OVERNIGHT</ServiceType><PackagingType>YOUR_PACKAGING</PackagingType><TotalWeight><Units>LB</Units><Value>10.0</Value></TotalWeight><Shipper><AccountNumber></AccountNumber><Contact><CompanyName>FedEx-WAPI</CompanyName><PhoneNumber>1234567890</PhoneNumber></Contact><Address><StreetLines>SN2000 Test Meter 8</StreetLines><StreetLines>10 Fedex Parkway</StreetLines><City>Collierville</City><StateOrProvinceCode>TN</StateOrProvinceCode><PostalCode>38017</PostalCode><CountryCode>US</CountryCode></Address></Shipper><Recipient><AccountNumber>214877600</AccountNumber><Contact><PersonName>Recipient Contact</PersonName><PhoneNumber>1234567890</PhoneNumber></Contact><Address><StreetLines>Recipient Address Line 1</StreetLines><StreetLines>Recipient Address Line 2</StreetLines><City>Texas</City><StateOrProvinceCode>TX</StateOrProvinceCode><PostalCode>73301</PostalCode><CountryCode>US</CountryCode></Address></Recipient><ShippingChargesPayment><PaymentType>SENDER</PaymentType><Payor><AccountNumber></AccountNumber><CountryCode>USD</CountryCode></Payor></ShippingChargesPayment><LabelSpecification><LabelFormatType>COMMON2D</LabelFormatType><ImageType>PNG</ImageType><LabelStockType>PAPER_4X6</LabelStockType></LabelSpecification><RateRequestTypes>ACCOUNT</RateRequestTypes><PackageCount>1</PackageCount><PackageDetail>INDIVIDUAL_PACKAGES</PackageDetail><RequestedPackageLineItems><SequenceNumber>1</SequenceNumber><Weight><Units>LB</Units><Value>10.0</Value></Weight><Dimensions><Length>10</Length><Width>10</Width><Height>10</Height><Units>IN</Units></Dimensions><ContentRecords><PartNumber>123445</PartNumber><ItemNumber>kjdjalsro1262739827</ItemNumber><ReceivedQuantity>12</ReceivedQuantity><Description>ContentDescription</Description></ContentRecords></RequestedPackageLineItems></RequestedShipment></ProcessShipmentRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>